tests/integration/MOM/pureBreakup/MOC-template/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}

application twoPhaseEulerFoam;

startFrom startTime;

startTime 0;

stopAt endTime;

endTime 1;

deltaT 1e-3;

writeControl runTime;

writeInterval 10;

purgeWrite 0;

writeFormat binary;

writePrecision 6;

writeCompression compressed;

timeFormat general;

timePrecision 6;

runTimeModifiable yes;
adjustTimeStep no;
maxCo 0.5;

maxDeltaT 1;

libs
  (
    "libPBE.so"
  );

functions
{
  probes
  {
    functionObjectLibs
      (
        "libsampling.so"
      );
    type probes; 	// Name of the directory for probe data
    name probes; 	// Write at same frequency as fields
    outputControl timeStep;
    outputInterval 10; 	// Fields to be probed
    fields
      80
      (
        n0
        n1
        n2
        n3
        n4
        n5
        n6
        n7
        n8
        n9
        n10
        n11
        n12
        n13
        n14
        n15
        n16
        n17
        n18
        n19
        n20
        n21
        n22
        n23
        n24
        n25
        n26
        n27
        n28
        n29
        n30
        n31
        n32
        n33
        n34
        n35
        n36
        n37
        n38
        n39
        n40
        n41
        n42
        n43
        n44
        n45
        n46
        n47
        n48
        n49
        n50
        n51
        n52
        n53
        n54
        n55
        n56
        n57
        n58
        n59
        n60
        n61
        n62
        n63
        n64
        n65
        n66
        n67
        n68
        n69
        n70
        n71
        n72
        n73
        n74
        n75
        n76
        n77
        n78
        n79
      );
    probeLocations
      (
        (0.5 0.5 0.5)
      ); 	// box centre
  }
} 	// ************************************************************************* //

