tests/integration/MOM/pureBreakup/MOC-template/constant/phaseProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "constant";
 object phaseProperties;
}

phases
  (
    air
    water
  );

air
{
  diameterModel PBEDiameter;
  PBEDiameterCoeffs
  {
    method methodOfClasses;
    MOCCoeffs
    {
      numberOfClasses 80;
      xi1 0.0125;
    }
    coalescenceKernel noCoalescence;
    breakupKernel binaryBreakup;
    daughterParticleDistribution uniformBinaryBreakup;
    noCoalescenceCoeffs
    {
    }
    noBreakupCoeffs
    {
    }
    binaryBreakupCoeffs
    {
    }
    uniformBinaryBreakupCoeffs
    {
    }
  }
}

water
{
  diameterModel constant;
  constantCoeffs
  {
    d 0.0001;
  }
}

blending
{
  default
  {
    type none;
    continuousPhase water;
  }
}

sigma
  (

    (
      air
      and
      water
    )
    0.07
  );

aspectRatio
  (

    (
      air
      in
      water
    )

    {
      type constant;
      E0 1.0;

    }
  );

drag
  (

    (
      air
      in
      water
    )

    {
      type SchillerNaumann;
      residualAlpha 1e-06;
      residualRe 0.001;
      swarmCorrection
      {
        type none;
      }

    }
  );

virtualMass
  (

    (
      air
      in
      water
    )

    {
      type constantCoefficient;
      Cvm 0.5;

    }
  );

heatTransfer
  (

    (
      air
      in
      water
    )

    {
      type RanzMarshall;
      residualAlpha 0.0001;

    }
  );

lift
  (
  );

wallLubrication
  (
  );

turbulentDispersion
  (
  ); 	// Minimum allowable pressure

pMin 10000; 	// ************************************************************************* //

